modules/pspmacs-multimedia.el
;;; pspmacs-multimedia.el --- Emacs multimedia -*- lexical-binding: t; -*-

;; Copyright © 2023  Pradyumna Swanand Paranjape

;; Author: Pradyumna Swanand Paranjape <pradyparanjpe@rediffmail.com>
;; Keywords: help, languages

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU Lesser General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU Lesser General Public License for more details.

;; You should have received a copy of the GNU Lesser General Public License
;; along with this program.  If not, see <https://www.gnu.org/licenses/>.

;;; Commentary:

;;; Code:

(use-package emms
  :custom
  (emms-directory (file-name-as-directory
                   (expand-file-name xdg/emacs-cache-directory "emms")))
  :config
  (add-to-list 'emms-player-list 'emms-player-mpv))

(pspmacs/load-inherit)
;;; pspmacs-multimedia.el ends here
